In [5]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os

In [6]:
engine = create_engine('mysql+pymysql://root:password@localhost/sakila')

In [7]:
def RunSQL(sql_command):
    connection = pymysql.connect(host='localhost',
                             user='root',
                             password='password',
                             db='sakila',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)
    try:
        with connection.cursor() as cursor:
            commands = sql_command.split(';')
            for command in commands:
                if command == '\n': continue
                cursor.execute(command + ';')
                connection.commit()
    except Exception as e: 
        print(e)
    finally:
        connection.close()

In [8]:
#1a. Display the first and last names of all actors from the table actor. 
sql_query = """
select first_name, last_name
from actor;
"""

actor = pd.read_sql_query(sql_query, engine)
actor.head()

  first_name     last_name
0   PENELOPE       GUINESS
1       NICK      WAHLBERG
2         ED         CHASE
3   JENNIFER         DAVIS
4     JOHNNY  LOLLOBRIGIDA

In [9]:
#1b. Display the first and last name of each actor in a single column in upper case letters. 
#Name the column Actor Name. 

sql_query = """
select concat(first_name, " ", last_name)
as "Actor Name"
from actor;

"""
actor2 = pd.read_sql_query(sql_query, engine)
actor2.head()

            Actor Name
0     PENELOPE GUINESS
1        NICK WAHLBERG
2             ED CHASE
3       JENNIFER DAVIS
4  JOHNNY LOLLOBRIGIDA

In [10]:
#2a. You need to find the ID number, first name, and last name of an actor, of whom you know only the first name, "Joe." 
#What is one query would you use to obtain this information?

sql_query = """
select actor_id, first_name, last_name
from actor
where first_name = "Joe";
"""

actor3 = pd.read_sql_query(sql_query, engine)
actor3.head()

   actor_id first_name last_name
0         9        JOE     SWANK

In [11]:
#2b. Find all actors whose last name contain the letters GEN:
sql_query = """
select actor_id, first_name, last_name
from actor
where last_name like '%%GEN%%';
"""

actor4 = pd.read_sql_query(sql_query, engine)
actor4.head()

   actor_id first_name  last_name
0        14     VIVIEN     BERGEN
1        41      JODIE  DEGENERES
2       107       GINA  DEGENERES
3       166       NICK  DEGENERES

In [12]:
#2c. Find all actors whose last names contain the letters LI. 
#This time, order the rows by last name and first name, in that order:
sql_query = """
select actor_id, first_name, last_name
from actor
where last_name like '%%LI%%'
order by last_name, first_name asc;
"""

actor5 = pd.read_sql_query(sql_query, engine)
actor5

   actor_id first_name last_name
0        86       GREG   CHAPLIN
1        82      WOODY     JOLIE
2        34     AUDREY   OLIVIER
3        15       CUBA   OLIVIER
4       172    GROUCHO  WILLIAMS
5       137     MORGAN  WILLIAMS
6        72       SEAN  WILLIAMS
7        83        BEN    WILLIS
8        96       GENE    WILLIS
9       164   HUMPHREY    WILLIS

In [13]:
#2d. Using IN, display the country_id and country columns of the following countries: 
#Afghanistan, Bangladesh, and China:

sql_query = """
select country_id, country
from country
where country in ('Afghanistan', 'Bangladesh', 'China');
"""
country = pd.read_sql_query(sql_query, engine)
country.head()

   country_id      country
0           1  Afghanistan
1          12   Bangladesh
2          23        China

In [60]:
#3a. Add a middle_name column to the table actor. Position it between first_name and last_name. 
#Hint: you will need to specify the data type.

sql_command = """
alter table actor add column middle_name varchar(45) not null;
alter table actor modify middle_name varchar(45) after first_name;
"""

RunSQL(sql_command)
actor6 = pd.read_sql_query('select * from actor', engine)
actor6.head()

(1060, "Duplicate column name 'middle_name'")

   actor_id first_name middle_name     last_name         last_update
0         1   PENELOPE                   GUINESS 2006-02-15 04:34:33
1         2       NICK                  WAHLBERG 2006-02-15 04:34:33
2         3         ED                     CHASE 2006-02-15 04:34:33
3         4   JENNIFER                     DAVIS 2006-02-15 04:34:33
4         5     JOHNNY              LOLLOBRIGIDA 2006-02-15 04:34:33

In [62]:
#3b. You realize that some of these actors have tremendously long last names. 
#Change the data type of the middle_name column to blobs.

sql_command = """
alter table actor modify middle_name blob;
"""

RunSQL(sql_command)

#actor7 = pd.read_sql_query('select * from actor', engine)
#actor7.head()

(1065, 'Query was empty')

In [63]:
#3c. Now delete the middle_name column.

sql_command = """
alter table actor drop column middle_name;

"""
RunSQL(sql_command)
actor8 = pd.read_sql_query('select * from actor', engine)
actor8.head()

(1065, 'Query was empty')

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [74]:
#4a. List the last names of actors, as well as how many actors have that last name.

sql_query = """
select last_name, count(*) as number from actor
group by last_name
order by number desc
"""

new_df = pd.read_sql_query(sql_query, engine)
new_df.head(10)

   last_name  number
0     KILMER       5
1     TEMPLE       4
2      NOLTE       4
3  ZELLWEGER       3
4  DEGENERES       3
5      ALLEN       3
6  JOHANSSON       3
7    GUINESS       3
8    GARLAND       3
9       PECK       3

In [77]:
#4b. List last names of actors and the number of actors who have that last name, 
#but only for names that are shared by at least two actors

sql_query = """
select last_name, count(*) as 'number' from actor
group by last_name
having number >= 2
order by number desc
"""

new_df2 = pd.read_sql_query(sql_query, engine)
new_df2.head(10)

   last_name  number
0     KILMER       5
1     TEMPLE       4
2      NOLTE       4
3  ZELLWEGER       3
4  DEGENERES       3
5      ALLEN       3
6  JOHANSSON       3
7    GUINESS       3
8    GARLAND       3
9       PECK       3

In [122]:
#4c. Oh, no! The actor HARPO WILLIAMS was accidentally entered in the actor table as GROUCHO WILLIAMS, 
#the name of Harpo's second cousin's husband's yoga teacher. Write a query to fix the record.

new_df = pd.read_sql_query('select * from actor where first_name = "Groucho"', engine)
new_df.head()

   actor_id first_name last_name         last_update
0        78    GROUCHO   SINATRA 2006-02-15 04:34:33
1       106    GROUCHO     DUNST 2006-02-15 04:34:33
2       172    GROUCHO  WILLIAMS 2006-02-15 04:34:33

In [125]:
sql_command = """
update actor
set first_name = "HARPO"
where actor_id = 172;
"""
RunSQL(sql_command)

In [126]:
new_df = pd.read_sql_query('select * from actor where first_name = "Harpo"', engine)
new_df.head()

   actor_id first_name last_name         last_update
0       172      HARPO  WILLIAMS 2018-02-25 19:27:41

In [127]:
#4d. Perhaps we were too hasty in changing GROUCHO to HARPO. It turns out that GROUCHO was the correct name after all! 
#In a single query, if the first name of the actor is currently HARPO, change it to GROUCHO. 
#Otherwise, change the first name to MUCHO GROUCHO, as that is exactly what the actor will be with the grievous error. 
#BE CAREFUL NOT TO CHANGE THE FIRST NAME OF EVERY ACTOR TO MUCHO GROUCHO, HOWEVER! 
#(Hint: update the record using a unique identifier.)

sql_command = """
update actor
set first_name = "GROUCHO"
where first_name = "HARPO";
"""
RunSQL(sql_command)

In [128]:
new_df = pd.read_sql_query('select * from actor where first_name = "Groucho"', engine)
new_df.head()

   actor_id first_name last_name         last_update
0        78    GROUCHO   SINATRA 2006-02-15 04:34:33
1       106    GROUCHO     DUNST 2006-02-15 04:34:33
2       172    GROUCHO  WILLIAMS 2018-02-25 19:29:47

In [69]:
#5a. You cannot locate the schema of the address table. Which query would you use to re-create it? 
#Hint: https://dev.mysql.com/doc/refman/5.7/en/show-create-table.html
    
sql_query = """
show create table address;
"""
data = engine.execute(sql_query)
for record in data:
    print(record)

('address', 'CREATE TABLE `address` (\n  `address_id` smallint(5) unsigned NOT NULL AUTO_INCREMENT,\n  `address` varchar(50) NOT NULL,\n  `address2` varchar(50) D ... (416 characters truncated) ... NT `fk_address_city` FOREIGN KEY (`city_id`) REFERENCES `city` (`city_id`) ON UPDATE CASCADE\n) ENGINE=InnoDB AUTO_INCREMENT=606 DEFAULT CHARSET=utf8')

In [208]:
#6a. Use JOIN to display the first and last names, as well as the address, of each staff member. 
#Use the tables staff and address:

sql_query = """
select staff.first_name, staff.last_name, address.address, address.district, address.city_id, address.postal_code
from staff
inner join address on
staff.address_id = address.address_id;
"""
finished_query = pd.read_sql_query(sql_query, engine)
finished_query.head()

  first_name last_name               address district  city_id postal_code
0       Mike   Hillyer     23 Workhaven Lane  Alberta      300
1        Jon  Stephens  1411 Lillydale Drive      QLD      576

In [210]:
#6b. Use JOIN to display the total amount rung up by each staff member in August of 2005. 
#Use tables staff and payment. 
sql_query = """
select payment.staff_id, max(staff.first_name) as 'first_name', max(staff.last_name) as 'last_name', sum(payment.amount) as 'august_sales'
from payment

inner join staff
on staff.staff_id = payment.staff_id
where payment.payment_date between '2005-08-01' and '2005-08-31'

group by staff_id
"""

inner_join = pd.read_sql_query(sql_query, engine)
inner_join

   staff_id first_name last_name  august_sales
0         1       Mike   Hillyer      11853.65
1         2        Jon  Stephens      12218.48

In [212]:
#6c. List each film and the number of actors who are listed for that film. Use tables film_actor and film. 
#Use inner join.

sql_query = """
select film_actor.film_id, max(film.title) as 'title', count(film_actor.actor_id) as 'actor count'
from film_actor

inner join film
on film.film_id = film_actor.film_id

group by film_id
"""

inner_join = pd.read_sql_query(sql_query, engine)
inner_join.head()

   film_id             title  actor count
0        1  ACADEMY DINOSAUR           10
1        2    ACE GOLDFINGER            4
2        3  ADAPTATION HOLES            5
3        4  AFFAIR PREJUDICE            5
4        5       AFRICAN EGG            5

In [109]:
#6d. How many copies of the film Hunchback Impossible exist in the inventory system?

new_df = pd.read_sql_query('select * from film where title = "Hunchback Impossible"', engine)
new_df.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,439,HUNCHBACK IMPOSSIBLE,A Touching Yarn of a Frisbee And a Dentist who...,2006,1,None,4,4.99,151,28.99,PG-13,"Trailers,Deleted Scenes",2006-02-15 05:03:42

In [112]:
new_df = pd.read_sql_query('select count(*) from inventory where film_id = 439', engine)
new_df

   count(*)
0         6

In [214]:
#6e. Using the tables payment and customer and the JOIN command, list the total paid by each customer. 
#List the customers alphabetically by last name:
    
sql_query = """
select payment.customer_id, max(customer.first_name) as 'first_name', max(customer.last_name) as 'last_name', sum(payment.amount) as 'total_paid'
from payment

inner join customer
on payment.customer_id = customer.customer_id

group by customer_id
order by last_name asc
"""

inner_join = pd.read_sql_query(sql_query, engine)
inner_join.head()

   customer_id first_name  last_name  total_paid
0          505     RAFAEL      ABNEY       97.79
1          504  NATHANIEL       ADAM      133.72
2           36   KATHLEEN      ADAMS       92.73
3           96      DIANA  ALEXANDER      105.73
4          470     GORDON     ALLARD      160.68

In [152]:
#7a. The music of Queen and Kris Kristofferson have seen an unlikely resurgence. 
#As an unintended consequence, films starting with the letters K and Q have also soared in popularity. 
#Use subqueries to display the titles of movies starting with the letters K and Q whose language is English. 

sql_query = """
SELECT title, language_id
FROM film
WHERE (title LIKE 'Q%%' OR title LIKE 'K%%') and language_id in
(
  select language_id
  from language
  where name = "English"
 
);
"""
joined = pd.read_sql_query(sql_query, engine)
joined

               title  language_id
0      KANE EXORCIST            1
1        KARATE MOON            1
2   KENTUCKIAN GIANT            1
3      KICK SAVANNAH            1
4   KILL BROTHERHOOD            1
5    KILLER INNOCENT            1
6     KING EVOLUTION            1
7         KISS GLORY            1
8      KISSING DOLLS            1
9      KNOCK WARLOCK            1
10  KRAMER CHOCOLATE            1
11     KWAI HOMEWARD            1
12        QUEEN LUKE            1
13   QUEST MUSSOLINI            1
14       QUILLS BULL            1

In [141]:
new_df = pd.read_sql_query('select * from film where title = "Alone Trip"', engine)
new_df.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,17,ALONE TRIP,A Fast-Paced Character Study of a Composer And...,2006,1,None,3,0.99,82,14.99,R,"Trailers,Behind the Scenes",2006-02-15 05:03:42

In [154]:
#7b. Use subqueries to display all actors who appear in the film Alone Trip.

sql_query = """
select first_name, last_name, actor_id
from actor
where actor_id in
(
  select actor_id
  from film_actor
  where film_id in
  (
    select film_id
    from film 
    where title = "Alone Trip"
  ) 
);
"""
joined = pd.read_sql_query(sql_query, engine)
joined.head()

  first_name last_name  actor_id
0         ED     CHASE         3
1       KARL     BERRY        12
2        UMA      WOOD        13
3      WOODY     JOLIE        82
4    SPENCER      DEPP       100

In [164]:
#7c. You want to run an email marketing campaign in Canada, for which you will need the names and email addresses 
#of all Canadian customers. Use joins to retrieve this information.

sql_query = """
select customer.address_id, customer.first_name, customer.last_name, customer.email, address.city_id, city.country_id, country.country
from customer

inner join address
on customer.address_id = address.address_id

inner join city
on address.city_id = city.city_id

inner join country
on city.country_id = country.country_id
where country.country = "Canada"

"""

inner_join = pd.read_sql_query(sql_query, engine)
inner_join

,address_id,first_name,last_name,email,city_id,country_id,country
0,481,DERRICK,BOURQUE,DERRICK.BOURQUE@sakilacustomer.org,179,20,Canada
1,468,DARRELL,POWER,DARRELL.POWER@sakilacustomer.org,196,20,Canada
2,193,LORETTA,CARPENTER,LORETTA.CARPENTER@sakilacustomer.org,383,20,Canada
3,415,CURTIS,IRBY,CURTIS.IRBY@sakilacustomer.org,430,20,Canada
4,441,TROY,QUIGLEY,TROY.QUIGLEY@sakilacustomer.org,565,20,Canada

In [215]:
#7d. Sales have been lagging among young families, and you wish to target all family movies for a promotion. 
#Identify all movies categorized as famiy films.

sql_query = """
select film.film_id, film.title, film_category.category_id, category.name
from film

inner join film_category
on film.film_id = film_category.film_id

inner join category
on film_category.category_id= category.category_id
where category.name = "Family"

"""

inner_join = pd.read_sql_query(sql_query, engine)
inner_join.head()

   film_id            title  category_id    name
0        5      AFRICAN EGG            8  Family
1       31    APACHE DIVINE            8  Family
2       43   ATLANTIS CAUSE            8  Family
3       50  BAKED CLEOPATRA            8  Family
4       53        BANG KWAI            8  Family

In [180]:
#7e. Display the most frequently rented movies in descending order.

sql_query = """
select film.film_id, max(film.title) as 'title', count(rental.rental_id) as 'rental_count'
from film

inner join inventory
on film.film_id = inventory.film_id

inner join rental
on inventory.inventory_id= rental.inventory_id

group by film.film_id
order by rental_count desc

"""

inner_join = pd.read_sql_query(sql_query, engine)
inner_join.head()

   film_id               title  rental_count
0      103  BUCKET BROTHERHOOD            34
1      738    ROCKETEER MOTHER            33
2      331      FORWARD TEMPLE            32
3      382      GRIT CLOCKWORK            32
4      767       SCALAWAG DUCK            32

In [217]:
#7f. Write a query to display how much business, in dollars, each store brought in.


sql_query = """
select store.store_id, sum(payment.amount) as 'total_revenue'
from store

inner join inventory
on store.store_id = inventory.store_id

inner join rental
on inventory.inventory_id= rental.inventory_id

inner join payment
on rental.rental_id= payment.rental_id

group by store.store_id
"""

inner_join = pd.read_sql_query(sql_query, engine)
inner_join.head()

   store_id  total_revenue
0         1       33679.79
1         2       33726.77

In [190]:
#7g. Write a query to display for each store its store ID, city, and country.

sql_query = """
select store.store_id, city.city, country.country
from store

inner join address
on store.address_id = address.address_id

inner join city
on address.city_id= city.city_id

inner join country
on city.country_id= country.country_id

"""

inner_join = pd.read_sql_query(sql_query, engine)
inner_join.head()

   store_id        city    country
0         1  Lethbridge     Canada
1         2   Woodridge  Australia

In [201]:
#7h. List the top five genres in gross revenue in descending order. 
#(Hint: you may need to use the following tables: category, film_category, inventory, payment, and rental.)

sql_query = """
select max(category.name) as "genre", sum(payment.amount) as 'revenue'
from category

inner join film_category
on category.category_id = film_category.category_id

inner join inventory
on film_category.film_id= inventory.film_id

inner join rental
on inventory.inventory_id= rental.inventory_id

inner join payment
on rental.rental_id= payment.rental_id

group by category.name
order by revenue desc
limit 5

"""

inner_join = pd.read_sql_query(sql_query, engine)
inner_join

       genre  revenue
0     Sports  5314.21
1     Sci-Fi  4756.98
2  Animation  4656.30
3      Drama  4587.39
4     Comedy  4383.58

In [204]:
#8a. In your new role as an executive, you would like to have an easy way of viewing the Top five genres 
#by gross revenue. Use the solution from the problem above to create a view. 
#If you haven't solved 7h, you can substitute another query to create a view.

sql_query = """

create view top_genre as

select max(category.name) as "genre", sum(payment.amount) as 'revenue'
from category

inner join film_category
on category.category_id = film_category.category_id

inner join inventory
on film_category.film_id= inventory.film_id

inner join rental
on inventory.inventory_id= rental.inventory_id

inner join payment
on rental.rental_id= payment.rental_id

group by category.name
order by revenue desc
limit 5

"""

RunSQL(sql_query)

In [205]:
#8b. How would you display the view that you created in 8a?

top_genre= pd.read_sql_query('select * from top_genre', engine)
top_genre.head()

       genre  revenue
0     Sports  5314.21
1     Sci-Fi  4756.98
2  Animation  4656.30
3      Drama  4587.39
4     Comedy  4383.58

In [206]:
#8c. You find that you no longer need the view top_five_genres. Write a query to delete it.

RunSQL('drop view top_genre')